0xA2C3B1F4/Salpa/security/esp-idf-bootloader/sdkconfig.defaults.esp32s2-signed-ab-development
# Reversible signed A/B device test. No security eFuse features.
CONFIG_IDF_TARGET="esp32s2"

CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_OFFSET=0xE000

# Keep the reversible device-test boot log observable without an external UART.
# The application takes over the native USB peripheral after the bootloader exits.
CONFIG_ESP_CONSOLE_USB_CDC=y
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set

CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_RISSOKEY_SIGNED_AB_BOOTLOADER=y
CONFIG_SECURE_SIGNED_APPS_NO_SECURE_BOOT=y
CONFIG_SECURE_SIGNED_APPS_RSA_SCHEME=y
CONFIG_SECURE_SIGNED_ON_UPDATE_NO_SECURE_BOOT=y
# CONFIG_SECURE_BOOT_BUILD_SIGNED_BINARIES is not set

# The build tool appends CONFIG_RISSOKEY_UPDATE_KEY_DIGEST_HEX to an external
# copy of these defaults. The digest is public; the signing key stays outside Git.

# CONFIG_SECURE_BOOT is not set
# CONFIG_SECURE_FLASH_ENC_ENABLED is not set
